In [1]:
import pandas as pd
import numpy as np

Question 1
Question: Select all numeric columns except float from the DataFrame dft.

In [13]:
dft = pd.DataFrame(
    {
        "A": np.random.rand(5), 
        "B": 1, 
        "C": "foo", 
        "D": pd.Timestamp("20251028"), 
        "E": pd.Series([2.0] * 5).astype("float32"), 
        "F": False, 
        "G": pd.Series([3] * 5, dtype="int8")
    }
)
dft.select_dtypes(include=['number'], exclude=['float'])

   B  G
0  1  3
1  1  3
2  1  3
3  1  3
4  1  3

Question 2
Question: How do you return the last 3 rows of a DataFrame df?

In [ ]:
df = pd.DataFrame(
    {
        "A": np.random.rand(5), 
        "B": 1, 
        "C": "foo", 
        "D": pd.Timestamp("20251028"), 
        "E": pd.Series([2.0] * 5).astype("float32"), 
        "F": False, 
        "G": pd.Series([3] * 5, dtype="int8")
    }
) 
df.tail(3)

          A  B    C          D    E      F  G
2  0.154540  1  foo 2025-10-28  2.0  False  3
3  0.778322  1  foo 2025-10-28  2.0  False  3
4  0.367017  1  foo 2025-10-28  2.0  False  3

Question 3
Question: Return the minimum and maximum of a Series x as a new Series with the index ["min", "max"].

In [43]:
x = pd.Series([10, 2, 45, 7, 30])
pd.Series([x.min(), x.max()], index=["min", "max"])

min     2
max    45
dtype: int64

Question 4
Question: Multiply df1 and df2 (two DataFrames) with a fill_value of 1.

In [ ]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list("bcd"), index=["Ohio", "Texas", "Colorado"])
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list("bde"), index=["Utah", "Ohio", "Texas", "Oregon"])

df1.multiply(df2, fill_value=1)

             b    c     d     e
Colorado   6.0  7.0   8.0   NaN
Ohio       0.0  1.0   8.0   5.0
Oregon     9.0  NaN  10.0  11.0
Texas     18.0  4.0  35.0   8.0
Utah       0.0  NaN   1.0   2.0

Question 5
Question: How do you create a DataFrame from a nested dictionary of dictionaries?

In [22]:
nested_dict = {'A': {'a': 1, 'b': 2}, 'B': {'a': 3, 'b': 4}}

In [ ]:
df3 = pd.DataFrame.from_dict(nested_dict,orient='index')
df3

   A  B
a  1  3
b  2  4